<h1>Pandas basic</h1>

In [1]:
import pandas as pd

In [2]:
# Создание DataFrame
data = {
    'A': [1, 2, 3],
    'B': [4, 5, 6],
    'C': [7, 8, 9]
}
df = pd.DataFrame(data, index=['row1', 'row2', 'row3'])

df.head()

      A  B  C
row1  1  4  7
row2  2  5  8
row3  3  6  9

In [3]:
# Доступ к строке по метке
print(df.loc['row1'])

A    1
B    4
C    7
Name: row1, dtype: int64

In [4]:
# Доступ к нескольким строкам
print(df.loc[['row1', 'row2']])

      A  B  C
row1  1  4  7
row2  2  5  8

In [5]:
# Доступ к строкам и столбцам
print(df.loc['row1', 'A'])  # Значение в строке 'row1' и столбце 'A'

1

In [6]:
# Доступ к срезу строк и столбцов
print(df.loc['row1':'row2', 'A':'B'])

      A  B
row1  1  4
row2  2  5

In [7]:
# Доступ к строке по индексу
print(df.iloc[0])  # Первая строка

A    1
B    4
C    7
Name: row1, dtype: int64

In [8]:
# Доступ к нескольким строкам
print(df.iloc[[0, 1]])  # Первые две строки

      A  B  C
row1  1  4  7
row2  2  5  8

In [9]:
# Доступ к строкам и столбцам по индексам
print(df.iloc[0, 0])  # Значение в первой строке и первом столбце

1

In [10]:
# Доступ к срезу строк и столбцов
print(df.iloc[0:2, 0:2])  # Первые две строки и первые два столбца

      A  B
row1  1  4
row2  2  5

In [11]:
df['A']

row1    1
row2    2
row3    3
Name: A, dtype: int64

In [12]:
data = {
    'Name': ['Alice', 'Bob', 'Charlie'],
    'Age': [25, 30, 35],
    'City': ['New York', 'Los Angeles', 'Chicago']
}
df = pd.DataFrame(data)
df.head()

      Name  Age         City
0    Alice   25     New York
1      Bob   30  Los Angeles
2  Charlie   35      Chicago

In [13]:
# Установка столбца 'Name' в качестве индекса
df_set_index = df.set_index('Name')

print(df_set_index)

         Age         City
Name
Alice     25     New York
Bob       30  Los Angeles
Charlie   35      Chicago

In [14]:
df_set_index = df.set_index('Name', drop=False)
print(df_set_index)

            Name  Age         City
Name
Alice      Alice   25     New York
Bob          Bob   30  Los Angeles
Charlie  Charlie   35      Chicago

In [15]:
df_set_index = df.set_index('Name').set_index('City', append=True)
print(df_set_index)

                     Age
Name    City
Alice   New York      25
Bob     Los Angeles   30
Charlie Chicago       35

In [16]:
df.set_index('Name', inplace=True)
print(df)

         Age         City
Name
Alice     25     New York
Bob       30  Los Angeles
Charlie   35      Chicago

In [17]:
data = {
        'Age': [25, 30, 35, 40],
        'Salary': [50000, 60000, 70000, 80000]
}
df = pd.DataFrame(data)
print(df.describe())

             Age        Salary
count   4.000000      4.000000
mean   32.500000  65000.000000
std     6.454972  12909.944487
min    25.000000  50000.000000
25%    28.750000  57500.000000
50%    32.500000  65000.000000
75%    36.250000  72500.000000
max    40.000000  80000.000000

In [18]:
print(df['Salary'].mean())

65000.0

In [19]:
print(df['Age'].sum())

130

In [20]:
 print(df['Salary'].count())

4

In [21]:
print(df['Age'].min())
print(df['Salary'].max())

25
80000

In [22]:
print(df['Salary'].median())

65000.0

In [23]:
print(df['Salary'].std())

12909.944487358056

In [24]:
#Позволяет группировать данные по определенному столбцу и применять агрегирующие функции
df.groupby('Age').mean()

      Salary
Age
25   50000.0
30   60000.0
35   70000.0
40   80000.0

In [26]:
df['Salary'] = df['Salary'].map(lambda x: x * 1.1)  # Увеличиваем зарплату на 10%
print(df['Salary'])

0    60500.0
1    72600.0
2    84700.0
3    96800.0
Name: Salary, dtype: float64

In [28]:
df['New_Column'] = df.apply(lambda row: row['Age'] + 10, axis=1)  # Добавляем 10 к возрасту
print(df['New_Column'])

0    35.0
1    40.0
2    45.0
3    50.0
Name: New_Column, dtype: float64

In [29]:
df.applymap(lambda x: x * 2)  # Удваиваем все значения в DataFrame

/tmp/ipykernel_14047/793467474.py:1: FutureWarning: DataFrame.applymap has been deprecated. Use DataFrame.map instead.
  df.applymap(lambda x: x * 2)  # Удваиваем все значения в DataFrame

   Age    Salary  New_Column
0   50  121000.0        70.0
1   60  145200.0        80.0
2   70  169400.0        90.0
3   80  193600.0       100.0

In [30]:
df['Salary_Transformed'] = df.groupby('Age')['Salary'].transform(lambda x: x / x.sum())
print(df['Salary_Transformed'])

0    1.0
1    1.0
2    1.0
3    1.0
Name: Salary_Transformed, dtype: float64